[
    {
        "bookId": 1,
        "bookName": "The Road",
        "author": "Cormac McCarthy",
        "image": "https://i.ibb.co.com/Gx6nFTD/The-Road.png",
        "review": "A haunting tale of a father and son’s journey through a post-apocalyptic landscape. It captures their struggle for survival amidst the desolation and despair of a dying world. McCarthy’s prose is spare yet poetic, forcing readers to confront the harsh realities of human existence. The bond between the father and son is portrayed with a depth that evokes deep emotional responses, leaving a lingering impression long after the last page is turned.",
        "totalPages": 287,
        "rating": 4.5,
        "category": "Fiction",
        "tags": ["Post-Apocalyptic", "Survival", "Father-Son"],
        "publisher": "Knopf",
        "yearOfPublishing": 2006
    },
    {
        "bookId": 2,
        "bookName": "Harry Potter and the Deathly Hallows",
        "author": "J.K. Rowling",
        "image": "https://i.ibb.co.com/9NKX1hg/Harry-Potter-and-the-Deathly-Hallows.png",
        "review": "The final installment in the Harry Potter series is filled with adventure, bravery, and heart-wrenching moments. As Harry and his friends face their most daunting challenges yet, themes of friendship, sacrifice, and the battle between good and evil come to the forefront. The book delivers a satisfying conclusion to the beloved saga, intertwining intricate plot threads that have been woven throughout the series. It leaves readers reflecting on the importance of choices and the power of love in overcoming darkness.",
        "totalPages": 759,
        "rating": 4.7,
        "category": "Fantasy",
        "tags": ["Magic", "Adventure", "Young Adult"],
        "publisher": "Bloomsbury",
        "yearOfPublishing": 2007
    },
    {
        "bookId": 3,
        "bookName": "The Hunger Games",
        "author": "Suzanne Collins",
        "image": "https://i.ibb.co.com/TY11Gk5/The-Hunger-Games.png",
        "review": "A gripping dystopian novel where children are forced to compete in a deadly televised event. Katniss Everdeen emerges as a fierce protagonist, representing defiance against oppression and societal cruelty. The story examines themes of survival, government control, and the morality of entertainment. Collins’ vivid descriptions and strong character development keep readers engaged, prompting them to ponder the ethical implications of such a society. This book challenges perceptions of heroism and sacrifice in dire circumstances.",
        "totalPages": 374,
        "rating": 4.6,
        "category": "Dystopian",
        "tags": ["Survival", "Adventure", "Young Adult"],
        "publisher": "Scholastic Press",
        "yearOfPublishing": 2008
    },
    {
        "bookId": 4,
        "bookName": "The Fault in Our Stars",
        "author": "John Green",
        "image": "https://i.ibb.co.com/wzcMK5F/The-Fault-in-Our-Stars.png",
        "review": "A deeply moving story that explores the lives of two teenagers dealing with cancer. Hazel and Augustus’s relationship is both tender and tragic, illustrating the joys and pains of young love in the face of terminal illness. The narrative deftly navigates the complexities of mortality, hope, and the search for meaning in a seemingly senseless world. Green’s poignant writing captures the essence of living fully, even when time is limited, making readers reflect on their own lives and relationships.",
        "totalPages": 313,
        "rating": 4.5,
        "category": "Young Adult",
        "tags": ["Romance", "Cancer", "Drama"],
        "publisher": "Dutton Books",
        "yearOfPublishing": 2012
    },
    {
        "bookId": 5,
        "bookName": "The Night Circus",
        "author": "Erin Morgenstern",
        "image": "https://i.ibb.co.com/pwm1HYX/The-Night-Circus.png",
        "review": "An enchanting tale of a magical competition between two young illusionists, set against the backdrop of a mysterious circus. The narrative is rich with lush imagery and intricate details that draw readers into a world where dreams and reality blur. As the story unfolds, themes of love, sacrifice, and destiny intertwine, creating a captivating experience. Morgenstern’s ability to weave together multiple perspectives adds depth to the characters, inviting readers to lose themselves in the wonder and magic of the circus.",
        "totalPages": 387,
        "rating": 4.4,
        "category": "Fantasy",
        "tags": ["Magic", "Love", "Competition"],
        "publisher": "Doubleday",
        "yearOfPublishing": 2011
    },
    {
        "bookId": 6,
        "bookName": "Where the Crawdads Sing",
        "author": "Delia Owens",
        "image": "https://i.ibb.co.com/wwVYNPb/Where-the-Crawdads-Sing.png",
        "review": "A beautifully written coming-of-age mystery set in the marshes of North Carolina. The story follows Kya, a girl abandoned by her family, who learns to navigate life alone in the wild. The vivid descriptions of nature serve as a backdrop to Kya’s emotional journey, exploring themes of loneliness, resilience, and the struggle for acceptance. Owens masterfully intertwines a murder mystery with Kya’s personal growth, making it a poignant reflection on the human experience and our connection to the natural world.",
        "totalPages": 368,
        "rating": 4.7,
        "category": "Mystery",
        "tags": ["Coming-of-Age", "Mystery", "Nature"],
        "publisher": "G.P. Putnam's Sons",
        "yearOfPublishing": 2018
    },
    {
        "bookId": 7,
        "bookName": "The Kite Runner",
        "author": "Khaled Hosseini",
        "image": "https://i.ibb.co.com/1MDhcTV/The-Kite-Runner.png",
        "review": "A powerful narrative of friendship, betrayal, and redemption set against the backdrop of Afghanistan’s tumultuous history. Amir’s journey from guilt to forgiveness is beautifully crafted, exploring the impact of personal choices on relationships. The book dives deep into themes of loyalty, love, and the complexities of cultural identity. Hosseini’s lyrical prose brings the characters to life, evoking a profound emotional response as readers witness Amir’s struggles and his ultimate quest for redemption.",
        "totalPages": 371,
        "rating": 4.3,
        "category": "Fiction",
        "tags": ["Friendship", "Redemption", "Afghanistan"],
        "publisher": "Riverhead Books",
        "yearOfPublishing": 2003
    },
    {
        "bookId": 8,
        "bookName": "Life of Pi",
        "author": "Yann Martel",
        "image": "https://i.ibb.co.com/f80Qh0c/Life-of-Pi.png",
        "review": "An extraordinary tale of survival and spirituality that follows a young boy stranded on a lifeboat with a Bengal tiger. The narrative explores the themes of faith, resilience, and the human spirit’s capacity to endure. Through Pi’s incredible journey, readers are invited to contemplate the nature of belief and the power of storytelling. Martel’s vivid imagery and philosophical reflections make this not just a survival story, but a deep exploration of the complexities of life and the relationships we form with others.",
        "totalPages": 319,
        "rating": 4.5,
        "category": "Adventure",
        "tags": ["Survival", "Adventure", "Philosophy"],
        "publisher": "Knopf",
        "yearOfPublishing": 2001
    },
    {
        "bookId": 9,
        "bookName": "The Road",
        "author": "Cormac McCarthy",
        "image": "https://i.ibb.co.com/Gx6nFTD/The-Road.png",
        "review": "A post-apocalyptic odyssey that delves into the depths of despair and the unbreakable bond between a father and son. The stark landscape reflects their struggles and hopes as they journey through a world stripped of civilization. McCarthy’s minimalistic yet profound writing style invites readers to ponder the essence of humanity and survival. The emotional weight of their relationship shines through every page, leaving a haunting resonance that challenges the reader to reflect on love, loss, and the will to carry on in the face of overwhelming adversity.",
        "totalPages": 287,
        "rating": 4.5,
        "category": "Fiction",
        "tags": ["Survival", "Father-Son", "Post-Apocalyptic"],
        "publisher": "Knopf",
        "yearOfPublishing": 2006
    },
    {
        "bookId": 10,
        "bookName": "The Help",
        "author": "Kathryn Stockett",
        "image": "https://i.ibb.co.com/N6MQGMd/The-Help.png",
        "review": "A compelling exploration of the lives of African American maids in 1960s Mississippi, shedding light on the injustices they endure. The narratives of Aibileen, Minny, and Skeeter intertwine in a powerful commentary on race and gender. Stockett captures the complexities of friendship and courage as these women navigate societal barriers. The book balances humor with poignant moments, making it both an enlightening and emotionally resonant read that encourages reflection on the past and the ongoing struggle for equality.",
        "totalPages": 444,
        "rating": 4.8,
        "category": "Historical Fiction",
        "tags": ["Historical", "Race", "Friendship"],
        "publisher": "Amy Einhorn Books",
        "yearOfPublishing": 2009
    },
    {
        "bookId": 11,
        "bookName": "The Girl on the Train",
        "author": "Paula Hawkins",
        "image": "https://i.ibb.co.com/hF6gQ1p/The-Girl-on-the-Train.png",
        "review": "A psychological thriller that intricately weaves the lives of three women, exploring themes of memory, obsession, and betrayal. As the story unfolds, the unreliable narratives of the characters create an atmosphere of suspense and tension. Hawkins expertly crafts a tale that keeps readers guessing, leading to a shocking climax. The exploration of personal trauma and the complexities of human relationships add depth to the plot, making it a gripping read that examines the darker sides of love and trust.",
        "totalPages": 395,
        "rating": 4.2,
        "category": "Thriller",
        "tags": ["Psychological", "Mystery", "Suspense"],
        "publisher": "Riverhead Books",
        "yearOfPublishing": 2015
    },
    {
        "bookId": 12,
        "bookName": "A Man Called Ove",
        "author": "Fredrik Backman",
        "image": "https://i.ibb.co.com/L82zC63/A-Man-Called-Ove.png",
        "review": "A heartwarming story of a curmudgeonly old man whose solitary life is turned upside down by unexpected friendships. Ove’s journey of self-discovery is filled with humor and poignant moments as he learns to open his heart again. Backman’s writing is both witty and touching, allowing readers to see the beauty in everyday life and the importance of community. This novel serves as a reminder of how connections with others can transform even the most hardened of hearts, making it a truly uplifting read.",
        "totalPages": 368,
        "rating": 4.6,
        "category": "Fiction",
        "tags": ["Heartwarming", "Humor", "Life"],
        "publisher": "Atria Books",
        "yearOfPublishing": 2012
    },
    {
        "bookId": 13,
        "bookName": "The Night Circus",
        "author": "Erin Morgenstern",
        "image": "https://i.ibb.co.com/pwm1HYX/The-Night-Circus.png",
        "review": "An enchanting tale of a magical competition between two young illusionists, set against the backdrop of a mysterious circus. The narrative is rich with lush imagery and intricate details that draw readers into a world where dreams and reality blur. As the story unfolds, themes of love, sacrifice, and destiny intertwine, creating a captivating experience. Morgenstern’s ability to weave together multiple perspectives adds depth to the characters, inviting readers to lose themselves in the wonder and magic of the circus.",
        "totalPages": 387,
        "rating": 4.5,
        "category": "Fantasy",
        "tags": ["Magic", "Adventure", "Love"],
        "publisher": "Doubleday",
        "yearOfPublishing": 2011
    },
    {
        "bookId": 14,
        "bookName": "Big Little Lies",
        "author": "Liane Moriarty",
        "image": "https://i.ibb.co.com/TKXCGt6/Big-Little-Lies.png",
        "review": "Liane Moriarty’s *Big Little Lies* intricately weaves the lives of three women grappling with their personal struggles while navigating the complexities of motherhood and friendship. Set in a seemingly idyllic community, the story uncovers dark secrets and the reality of domestic violence. Moriarty's sharp wit and keen observations provide a deep dive into the characters' psyches, making readers reflect on the impact of societal pressures and the façade of perfection. The layers of intrigue and humor make it a compelling page-turner that keeps you guessing until the very end.",
        "totalPages": 460,
        "rating": 4.4,
        "category": "Fiction",
        "tags": ["Drama", "Mystery", "Friendship"],
        "publisher": "Amy Einhorn Books",
        "yearOfPublishing": 2014
    },
    {
        "bookId": 15,
        "bookName": "The Immortalists",
        "author": "Chloe Benjamin",
        "image": "https://i.ibb.co.com/gg8tXt2/The-Immortalists.png",
        "review": "In *The Immortalists*, Chloe Benjamin presents a profound exploration of fate and free will through the lives of four siblings who learn the dates of their deaths. Each sibling’s response to this knowledge shapes their life choices, leading to a narrative that delves into themes of mortality, love, and the weight of destiny. The novel artfully balances the personal and the universal, inviting readers to ponder how knowledge of the future influences the present. Benjamin's lyrical prose and deep character development create a hauntingly beautiful story that lingers long after the last page.",
        "totalPages": 368,
        "rating": 4.3,
        "category": "Fiction",
        "tags": ["Family", "Life", "Destiny"],
        "publisher": "G.P. Putnam's Sons",
        "yearOfPublishing": 2018
    },
    {
        "bookId": 16,
        "bookName": "Eleanor Oliphant Is Completely Fine",
        "author": "Gail Honeyman",
        "image": "https://i.ibb.co.com/N2rZCfF/Eleanor-Oliphant-Is-Completely-Fine.png",
        "review": "Gail Honeyman's *Eleanor Oliphant Is Completely Fine* introduces readers to the socially awkward and endearing Eleanor, who leads a solitary life shaped by her past traumas. As Eleanor's story unfolds, themes of loneliness, kindness, and the importance of human connection take center stage. The novel beautifully balances humor and heartbreak, showcasing Eleanor's gradual journey towards healing and self-acceptance. Honeyman's vivid characterization and poignant storytelling invite readers to reflect on their own lives and the transformative power of friendship and compassion.",
        "totalPages": 392,
        "rating": 4.4,
        "category": "Fiction",
        "tags": ["Heartwarming", "Humor", "Life"],
        "publisher": "Pamela Dorman Books",
        "yearOfPublishing": 2017
    },
    {
        "bookId": 17,
        "bookName": "Anxious People",
        "author": "Fredrik Backman",
        "image": "https://i.ibb.co.com/sVVvNRr/Anxious-People.png",
        "review": "In *Anxious People*, Fredrik Backman crafts a poignant and humorous narrative centered around a botched bank robbery that leads to a group of strangers being held hostage during an open house. As the characters reveal their unique stories, the novel explores themes of empathy, humanity, and the interconnectedness of our lives. Backman’s signature blend of wit and sensitivity illuminates the beauty of ordinary moments and the complexities of human relationships. This heartwarming tale serves as a reminder of the kindness and resilience that can emerge even in the most challenging circumstances.",
        "totalPages": 368,
        "rating": 4.5,
        "category": "Fiction",
        "tags": ["Humor", "Drama", "Humanity"],
        "publisher": "Atria Books",
        "yearOfPublishing": 2020
    },
    {
        "bookId": 18,
        "bookName": "Circe",
        "author": "Madeline Miller",
        "image": "https://i.ibb.co.com/CPDtXxQ/Circe.png",
        "review": "Madeline Miller’s *Circe* is a mesmerizing reimagining of the life of the famed witch from Greek mythology. Through Circe's eyes, readers are immersed in her struggles with identity, love, and power as she navigates the treacherous world of gods and mortals. Miller’s lyrical prose paints a vivid portrait of Circe’s evolution from an overlooked figure to a powerful being, reflecting on themes of feminism and agency. This beautifully crafted narrative captivates not only fans of mythology but anyone seeking a tale of resilience and self-discovery amidst the chaos of divine politics.",
        "totalPages": 400,
        "rating": 4.4,
        "category": "Fantasy",
        "tags": ["Mythology", "Feminism", "Magic"],
        "publisher": "Little, Brown and Company",
        "yearOfPublishing": 2018
    },
    {
        "bookId": 19,
        "bookName": "The Vanishing Half",
        "author": "Brit Bennett",
        "image": "https://i.ibb.co.com/x6cpP4N/The-Vanishing-Half.png",
        "review": "Brit Bennett's *The Vanishing Half* is a poignant exploration of race, identity, and the bonds of sisterhood through the lens of twin sisters who choose very different paths. As their lives unfold across different communities and circumstances, the novel delves into the complexities of self-identity and the societal pressures that shape our choices. Bennett's insightful writing captures the nuances of their experiences, making the characters relatable and deeply human. This multi-generational narrative invites readers to reflect on their own identities and the legacies that shape us, leaving a lasting impact.",
        "totalPages": 352,
        "rating": 4.5,
        "category": "Fiction",
        "tags": ["Race", "Identity", "Sisters"],
        "publisher": "Riverhead Books",
        "yearOfPublishing": 2020
    },
    {
        "bookId": 20,
        "bookName": "The Song of Achilles",
        "author": "Madeline Miller",
        "image": "https://i.ibb.co.com/ZNph9gF/The-Song-of-Achilles.png",
        "review": "In *The Song of Achilles*, Madeline Miller delivers a breathtaking retelling of the epic tale of Achilles and Patroclus. This beautifully woven narrative explores themes of love, honor, and the horrors of war against the backdrop of Greek mythology. Miller’s poignant prose captures the intensity of their bond and the tragic fate that awaits them, inviting readers to experience their journey with heart-wrenching intimacy. The story not only brings the ancient world to life but also reflects on the timeless nature of love and loss, making it an unforgettable read.",
        "totalPages": 368,
        "rating": 4.4,
        "category": "Historical Fiction",
        "tags": ["Mythology", "Love", "War"],
        "publisher": "Ecco",
        "yearOfPublishing": 2011
    }
]